In [6]:
#ej 1
import pandas as pd

In [7]:
libros = {
    'Titulo': ["El Quijote", "Cien años de soledad", "La odisea"],
    'Autores': ["Miguel de Cervantes", "Gabriel García Márquez", "Homero"],
    'Años': [1605, 1967, 800]
}

In [8]:
libros_df = pd.DataFrame(libros)

In [9]:
libros_df

                 Titulo                 Autores  Años
0            El Quijote     Miguel de Cervantes  1605
1  Cien años de soledad  Gabriel García Márquez  1967
2             La odisea                  Homero   800

In [10]:
#ej 2

In [11]:
# Datos proporcionados
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}
data_df = pd.DataFrame(data)

In [12]:
data_df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Luis    30  Barcelona
2  Carlos    22   Valencia
3    Sara    27     Bilbao

In [14]:
edad_filtr = data_df[data_df['Edad'] >= 25]

In [15]:
edad_filtr

  Nombre  Edad     Ciudad
0    Ana    25     Madrid
1   Luis    30  Barcelona
3   Sara    27     Bilbao

In [16]:
# ej 3

In [17]:
data2 = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}

In [18]:
df2 = pd.DataFrame(data2)

In [24]:
df2

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Luis    30  Barcelona
2  Carlos    22   Valencia
3    Sara    27     Bilbao

In [31]:
edad_10_años = df2['Edad'] + 10

In [32]:
df2['Edad en 10 Años'] = edad_10_años

In [33]:
df2

   Nombre  Edad     Ciudad  Edad en 10 Años
0     Ana    25     Madrid               35
1    Luis    30  Barcelona               40
2  Carlos    22   Valencia               32
3    Sara    27     Bilbao               37

In [34]:
df2['Ciudad'] = df2['Ciudad'].str.upper()

In [35]:
df2

   Nombre  Edad     Ciudad  Edad en 10 Años
0     Ana    25     MADRID               35
1    Luis    30  BARCELONA               40
2  Carlos    22   VALENCIA               32
3    Sara    27     BILBAO               37

In [37]:
df2['Es mayor a 25'] = df2['Edad'] >= 25

df2

In [38]:
df2

   Nombre  Edad     Ciudad  Edad en 10 Años  Es mayor a 25
0     Ana    25     MADRID               35           True
1    Luis    30  BARCELONA               40           True
2  Carlos    22   VALENCIA               32          False
3    Sara    27     BILBAO               37           True